### R - Data Input and Output

####  CSV Files reading and writing to data frames

In [1]:
# writing a dataframe to csv file using a built in data set iris
write.csv(iris,file = "iris_df.csv") # this creates comma separated iris_df.csv file in working director

In [2]:
# Reding a csv file to a dataframe
df <- read.csv(file = 'iris_df.csv')

In [3]:
is.data.frame(df)

[1] TRUE

In [4]:
head(df,3)

  X Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 1 5.1          3.5         1.4          0.2         setosa
2 2 4.9          3.0         1.4          0.2         setosa
3 3 4.7          3.2         1.3          0.2         setosa

### Reading the  EXCEL data

In [5]:
# We need to use a library for reading excel files
library(readxl)

In [6]:
# This command shows all the sheets in the excel work book
excel_sheets('TopBabyNamesbyState.xlsx')

[1] "Sheet1"              "Sheet5"              "TopBabyNamesbyState"

In [7]:
# Reading the sheet into a dataframe
babynamesdf <- read_xlsx(sheet= 'TopBabyNamesbyState', path = 'TopBabyNamesbyState.xlsx')

In [8]:
head(babynamesdf,2)

  State Gender Year Top Name Occurences
1 AK    F      1910 Mary     14
2 AK    F      1911 Mary     12

In [9]:
str(babynamesdf)

Classes ‘tbl_df’, ‘tbl’ and 'data.frame':	10506 obs. of  5 variables:
 $ State     : chr  "AK" "AK" "AK" "AK" ...
 $ Gender    : chr  "F" "F" "F" "F" ...
 $ Year      : num  1910 1911 1912 1913 1914 ...
 $ Top Name  : chr  "Mary" "Mary" "Mary" "Mary" ...
 $ Occurences: num  14 12 9 21 22 23 18 21 27 22 ...

In [10]:
summary(babynamesdf)

    State              Gender               Year        Top Name
 Length:10506       Length:10506       Min.   :1910   Length:10506
 Class :character   Class :character   1st Qu.:1935   Class :character
 Mode  :character   Mode  :character   Median :1961   Mode  :character
                                       Mean   :1961
                                       3rd Qu.:1987
                                       Max.   :2012
   Occurences
 Min.   :    8
 1st Qu.:  267
 Median :  718
 Mean   : 1186
 3rd Qu.: 1582
 Max.   :10023

In [11]:
babynamesdf[c('Top Name', 'Occurences')]

      Top Name    Occurences
1     Mary        14
2     Mary        12
3     Mary         9
4     Mary        21
5     Mary        22
6     Mary        23
7     Mary        18
8     Mary        21
9     Mary        27
10    Mary        22
11    Mary        38
12    Mary        36
13    Mary        29
14    Mary        26
15    Mary        41
16    Mary        24
17    Mary        39
18    Mary        30
19    Mary        27
20    Mary        25
21    Mary        35
22    Mary        41
23    Mary        26
24    Mary        25
25    Mary        31
26    Mary        29
27    Mary        33
28    Mary        41
29    Mary        37
30    Mary        28
...   ...         ...
10477 Michael     171
10478 Michael     144
10479 Christopher 142
10480 Christopher 125
10481 Michael      94
10482 Michael      99
10483 Michael     102
10484 Michael      83
10485 Michael      85
10486 Michael      74
10487 Tyler        90
10488 Austin       71
10489 Joshua       62
10490 Tyler        68
10491 Jacob        55
10492 Austin       55
10493 Michael      52
10494 Jacob        49
10495 Jacob        44
10496 Ethan        52
10497 Jacob        47
10498 Michael      34
10499 Jacob        41
10500 Ethan        44
10501 James        38
10502 James        41
10503 Wyatt        42
10504 James        36
10505 William      32
10506 Liam         41


### Connecting and reading SQL Database